#### FabricationConfiguration Members

---

|  |
| --- |
| FabricationConfiguration Class   Methods   Properties   See Also |

The  FabricationConfiguration  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | AncillaryExists | Checks to see if the specified ancillary exists. |
| Public method | AreItemFilesLoaded | Checks if the fabrication item files have been loaded. |
| Public method | ArePhasesModifiable | Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element. (Inherited from  Element  .) |
| Public method | CanBeHidden | Indicates if the element can be hidden in the view. (Inherited from  Element  .) |
| Public method | CanBeLocked | Identifies if the element can be locked. (Inherited from  Element  .) |
| Public method | CanBeSwapped | Checks if the fabrication configuration can be swapped. |
| Public method | CanDeleteSubelement | Checks if given subelement can be removed from the element. (Inherited from  Element  .) |
| Public method | CanHaveTypeAssigned | Identifies if the element can have a type assigned. (Inherited from  Element  .) |
| Public method | CanUnloadItemFiles | Checks if the fabrication item files are already in use and should not be unloaded. |
| Public method | ChangeTypeId(ElementId) | Changes the type of the element. (Inherited from  Element  .) |
| Public method | CustomDataExists | Checks to see if the specified custom data exists. |
| Public method | DamperExists | Checks to see if the specified damper exists. |
| Public method | DeleteEntity | Deletes the existing entity created by %schema% in the element (Inherited from  Element  .) |
| Public method | DeleteSubelement | Removes a subelement from the element. (Inherited from  Element  .) |
| Public method | DeleteSubelements | Removes the subelements from the element. (Inherited from  Element  .) |
| Public method | Dispose | (Inherited from  Element  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetAllDampers | Gets all damper identifiers in the fabrication configuration. |
| Public method | GetAllFabricationConnectorDefinitions | Gets fabrication connector identifiers from the fabrication configuration, filtered by shape and domain. |
| Public method | GetAllInsulationSpecifications | Gets all insulation specification identifiers in the fabrication configuration. |
| Public method | GetAllLoadedItemFiles | Get list of all loaded fabrication item files. |
| Public method | GetAllLoadedServices | Returns all the loaded fabrication services. |
| Public method | GetAllMaterials | Gets all material identifiers in the fabrication configuration. |
| Public method | GetAllPartCustomData | Gets all possible fabrication part custom data identifiers. |
| Public method | GetAllPartStatuses | Gets all possible fabrication part status identifiers. |
| Public method | GetAllServices | Returns all fabrication services in the fabrication configuration. |
| Public method | GetAllSpecifications | Gets all specification identifiers in the fabrication configuration. |
| Public method | GetAllUsedItemFiles | Returns all the used fabrication item files. A fabrication item file is used if any fabrication parts in the model were created from it. |
| Public method | GetAllUsedServices | Returns all the used fabrication services. A service is used if any fabrication part in the service is created by user. |
| Public method | GetAncillaries | Gets fabrication ancillaries of the specified type. |
| Public method | GetAncillaryGroup | Gets the fabrication ancillary group of the specified fabrication ancillary identifier. |
| Public method | GetAncillaryGroupName | Gets the fabrication ancillary group and name for the specified fabrication ancillary identifier. |
| Public method | GetAncillaryName | Gets the fabrication ancillary name for the specified fabrication ancillary identifier. |
| Public method | GetDamperName | Gets the damper name from its identifier. |
| Public method | GetDependentElements | Get all elements that, from a logical point of view, are the children of this Element. (Inherited from  Element  .) |
| Public method | GetEntity | Returns the existing entity corresponding to the Schema if it has been saved in the Element, or an invalid entity otherwise. (Inherited from  Element  .) |
| Public method | GetEntitySchemaGuids | Returns the Schema guids of any Entities stored in this element. (Inherited from  Element  .) |
| Public method | GetExternalFileReference | Gets information pertaining to the external file referenced by the element. (Inherited from  Element  .) |
| Public method | GetExternalResourceReference | Gets the ExternalResourceReference associated with a specified external resource type. (Inherited from  Element  .) |
| Public method | GetExternalResourceReferenceExpanded | Gets the collection of ExternalResourceReference associated with a specified external resource type. (Inherited from  Element  .) |
| Public method | GetExternalResourceReferences | Gets the map of the external resource references referenced by the element. (Inherited from  Element  .) |
| Public method | GetExternalResourceReferencesExpanded | Gets the expanded map of the external resource references referenced by the element. (Inherited from  Element  .) |
| Public method Static member | GetFabricationConfiguration | Gets the fabrication configuration element in the document. |
| Public method | GetFabricationConfigurationInfo | Gets the information about the fabrication configuration of the project. |
| Public method | GetFabricationConnectorDomain | Gets the fabrication connector domain from its identifier. |
| Public method | GetFabricationConnectorGroup | Gets the fabrication connector group from its identifier. |
| Public method | GetFabricationConnectorName | Gets the fabrication connector name from its identifier. |
| Public method | GetFabricationConnectorShape | Gets the fabrication connector shape from its identifier. |
| Public method | GetGeneratingElementIds | Returns the ids of the element(s) that generated the input geometry object. (Inherited from  Element  .) |
| Public method | GetGeometryObjectFromReference | Retrieve one geometric primitive contained in the element given a reference. (Inherited from  Element  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetInsulationSpecificationAbbreviation | Gets insulation specification abbreviation. |
| Public method | GetInsulationSpecificationGroup | Gets the insulation specification group from its identifier. |
| Public method | GetInsulationSpecificationName | Gets the insulation specification name from its identifier. |
| Public method | GetItemFolders | Gets a list of every fabrication item folder in the fabrication item folder structure. |
| Public method | GetMaterialAbbreviation | Gets the abreviation of the material or the insulation or the double wall material. |
| Public method | GetMaterialArea | Gets the area of the material with the given id. (Inherited from  Element  .) |
| Public method | GetMaterialGroup | Gets material group from its identifier. |
| Public method | GetMaterialIds | Gets the element ids of all materials present in the element. (Inherited from  Element  .) |
| Public method | GetMaterialName | Gets material name from its identifier. |
| Public method | GetMaterialVolume | Gets the volume of the material with the given id. (Inherited from  Element  .) |
| Public method | GetMonitoredLinkElementIds | Provides the link instance IDs when the element is monitoring. (Inherited from  Element  .) |
| Public method | GetMonitoredLocalElementIds | Provides the local element IDs when the element is monitoring. (Inherited from  Element  .) |
| Public method | GetOrderedParameters | Gets the parameters associated to the element in order. (Inherited from  Element  .) |
| Public method | GetParameter | Retrieves a parameter from the element given identifier. (Inherited from  Element  .) |
| Public method | GetParameterFormatOptions | Returns a FormatOptions override for the element Parameter, or a default FormatOptions if no override exists. (Inherited from  Element  .) |
| Public method | GetParameters | Retrieves the parameters from the element via the given name. (Inherited from  Element  .) |
| Public method | GetPartCustomDataName | Gets the custom data name from its identifier. |
| Public method | GetPartCustomDataType | Gets the custom data type from its identifier. See FabricationCustomDataType enumerator. |
| Public method | GetPartStatusDescription | Gets the status description from its identifier. |
| Public method | GetPhaseStatus | Gets the status of a given element in the input phase (Inherited from  Element  .) |
| Public method | GetProfile | Return the profile of the loaded fabrication configuration. Return empty string for global profile. |
| Public method | GetService | Get the service based on the service identifier from the fabrication configuration in the current document. |
| Public method | GetServiceTypeName | Gets the service type name. |
| Public method | GetSpecificationAbbreviation | Gets specification abreviation. |
| Public method | GetSpecificationGroup | Gets the specification group from its identifier. |
| Public method | GetSpecificationName | Gets the specification name from its identifier. |
| Public method | GetSubelements | Returns the collection of element subelements. (Inherited from  Element  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | GetTypeId | Returns the identifier of this element's type. (Inherited from  Element  .) |
| Public method | GetValidTypes | Obtains a set of types that are valid for this element. (Inherited from  Element  .) |
| Public method | HasPhases | Returns true if this Element has the properties CreatedPhaseId and DemolishedPhaseId. (Inherited from  Element  .) |
| Public method | HasValidConfiguration | Checks whether a valid fabrication configuration has been set for the project. |
| Public method | IsAncillaryKit | Gets whether the specified fabrication ancillary identifier is an ancillary kit or not. |
| Public method | IsCreatedPhaseOrderValid | Returns true if createdPhaseId and demolishedPhaseId are in order. (Inherited from  Element  .) |
| Public method | IsDemolishedPhaseOrderValid | Returns true if createdPhaseId and demolishedPhaseId are in order. (Inherited from  Element  .) |
| Public method | IsExternalFileReference | Determines whether this Element represents an external file. (Inherited from  Element  .) |
| Public method | IsHidden | Identifies if the element has been permanently hidden in the view. (Inherited from  Element  .) |
| Public method | IsMonitoringLinkElement | Indicate whether an element is monitoring any elements in any linked models. (Inherited from  Element  .) |
| Public method | IsMonitoringLocalElement | Indicate whether an element is monitoring other local elements. (Inherited from  Element  .) |
| Public method | IsPhaseCreatedValid | Returns true if createdPhaseId is an allowed value for the property CreatedPhaseId in this Element. (Inherited from  Element  .) |
| Public method | IsPhaseDemolishedValid | Returns true if demolishedPhaseId is an allowed value for the property DemolishedPhaseId in this Element. (Inherited from  Element  .) |
| Public method | IsValidType(ElementId) | Checks if given type is valid for this element. (Inherited from  Element  .) |
| Public method | LoadItemFiles | Loads the specified fabrication item files into the project. |
| Public method | LoadServices | Loads the specified fabrication services into the project. |
| Public method | LocateFabricationConnector | Gets the fabrication connector identifiers by group and name, filtered by shape and domain. |
| Public method | LocateInsulationSpecification | Gets the insulation specification by group and name. |
| Public method | LocateMaterial | Gets material by group and name. |
| Public method | LocateSpecification | Gets the specification identifier by group and name. |
| Public method | LookupParameter | Attempts to find a parameter on the element which has the given name. (Inherited from  Element  .) |
| Public method | RefersToExternalResourceReference | Determines whether this Element uses external resources associated with a specified external resource type. (Inherited from  Element  .) |
| Public method | RefersToExternalResourceReferences | Determines whether this Element uses external resources. (Inherited from  Element  .) |
| Public method | ReloadConfiguration | Reloads the fabrication configuration from its source fabrication configuration. |
| Public method | SetConfiguration(FabricationConfigurationInfo) | Set the fabrication configuration with global profile. |
| Public method | SetConfiguration(FabricationConfigurationInfo, String) | Set the fabrication configuration with specific profile. |
| Public method | SetEntity | Stores the entity in the element. If an Entity described by the same Schema already exists, it is overwritten. (Inherited from  Element  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |
| Public method | UnloadItemFiles | Unload the specified fabrication item files from the project. |
| Public method | UnloadServices | Unload the specified fabrication services from the project. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | AssemblyInstanceId | The id of the assembly instance to which the element belongs. (Inherited from  Element  .) |
| Public property | BoundingBox | Retrieves a box that circumscribes all geometry of the element. (Inherited from  Element  .) |
| Public property | Category | Retrieves a Category object that represents the category or sub category in which the element resides. (Inherited from  Element  .) |
| Public property | CreatedPhaseId | Id of a Phase at which the Element was created. (Inherited from  Element  .) |
| Public property | DemolishedPhaseId | Id of a Phase at which the Element was demolished. (Inherited from  Element  .) |
| Public property | DesignOption | Returns the design option to which the element belongs. (Inherited from  Element  .) |
| Public property | Document | Returns the Document in which the Element resides. (Inherited from  Element  .) |
| Public property | Geometry | Retrieves the geometric representation of the element. (Inherited from  Element  .) |
| Public property | GroupId | The id of the group to which an element belongs. (Inherited from  Element  .) |
| Public property | Id | A unique identifier for an Element in an Autodesk Revit project. (Inherited from  Element  .) |
| Public property | IsModifiable | Identifies if the element is modifiable. (Inherited from  Element  .) |
| Public property | IsTransient | Indicates whether an element is transient or permanent. (Inherited from  Element  .) |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  Element  .) |
| Public property | LevelId | The id of the level associated with the element. (Inherited from  Element  .) |
| Public property | Location | This property is used to find the physical location of an element within a project. (Inherited from  Element  .) |
| Public property | Name | A human readable name for the Element. (Inherited from  Element  .) |
| Public property | OwnerViewId | The id of the view that owns the element. (Inherited from  Element  .) |
| Public property | Parameter Guid | Retrieves a parameter from the element given a GUID for a shared parameter. (Inherited from  Element  .) |
| Public property | Parameter BuiltInParameter | Retrieves a parameter from the element given a parameter id. (Inherited from  Element  .) |
| Public property | Parameter Definition | Retrieves a parameter from the element based on its definition. (Inherited from  Element  .) |
| Public property | Parameters | Retrieves a set containing all of the parameters that are contained within the element. (Inherited from  Element  .) |
| Public property | ParametersMap | Retrieves a map containing all of the parameters that are contained within the element. (Inherited from  Element  .) |
| Public property | Pinned | Identifies if the element has been pinned to prevent changes. (Inherited from  Element  .) |
| Public property | UniqueId | A stable unique identifier for an element within the document. (Inherited from  Element  .) |
| Public property | VersionGuid | Get the element version Guid. (Inherited from  Element  .) |
| Public property | ViewSpecific | Identifies if the element is owned by a view. (Inherited from  Element  .) |
| Public property | WorksetId | Get Id of the Workset which owns the element. (Inherited from  Element  .) |

# See Also

FabricationConfiguration Class

Autodesk.Revit.DB Namespace